БИТУправление_медицинским_центром_демо/src/InformationRegisters/КДЛ_НастройкиВзаимодействия/КДЛ_НастройкиВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КДЛ_НастройкиВзаимодействия</name>
  <comment>Интеграция с лабораториями  КДЛ</comment>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПуть</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоздаватьНовуюНоменклатуру</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаЗагрузкиНоменклатуры</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьРеквизитыНоменклатурыПриПовторнойЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпециализацияНовойНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </resources>
  <resources>
    <name>Лаборант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОбрабатываемыхЗаРазФайлов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеЛаборатории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЛаборатории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерЭтикетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьРезультатыВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПредраспечатанныеШК</name>
    <comment>(согласуется между Клиникой и КДЛ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрагентПринципал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КДЛ_НастройкиВзаимодействия/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтикеткаШирина = Лев(Запись.РазмерЭтикетки, 3);
	ЭтикеткаВысота = Прав(Запись.РазмерЭтикетки, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.РазмерЭтикетки = Формат(ЭтикеткаШирина,"ЧЦ=3; ЧН=Ноль; ЧВН=") + "x" + Формат(ЭтикеткаВысота,"ЧЦ=3; ЧН=Ноль; ЧВН=");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура FTPСоединениеПутьПриИзменении(Элемент)
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Запись.FTPСоединениеПуть);
	
	Запись.FTPСоединениеПуть = СтруктураURI.Хост;
	
	Если СтруктураURI.Порт <> Неопределено Тогда
		Запись.FTPСоединениеПорт = СтруктураURI.Порт;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
